//산술연산자

#include<iostream>

int main()
{
	//int a, b;
	//a = 10;
	//b = 3;
	//printf("a+b : %d\n", a + b);
	//printf("a-b : %d\n", a - b);
	//printf("a*b : %d\n", a * b);
	//printf("a/b : %d\n", a / b);
	//printf("a%%b : %d\n", a % b);//'%'연산자는 오직 int형만 받는다.
	//대입 연산자는 오른쪽에서 왼쪽으로 진행된다.


	int a = 0xAF;//10101111 -> 64+16+4+2+1=87
	int b = 0xB5;//10110101 -> 64+16+8+4+1=92
	//A   -> 0000 0000 0000 0000 0000 0000 1010 1111
	//<<2 -> 0000 0000 0000 0000 0000 0010 1011 1100 2BC
	//~   -> 1111 1111 1111 1111 1111 1111 0101 0000 
	//B   -> 0000 0000 0000 0000 0000 0000 1011 0101
	//>>3 -> 0000 0000 0000 0000 0000 0000 0001 0110
	printf("%x\n", a & b);//10100101->A5
	printf("%x\n", a | b);//10111111->BF
	printf("%x\n", a ^ b);//00011010->1A
	printf("%x\n", a << 2);//10111100->BC
	printf("%x\n", b >> 3);//11110110->F6
	printf("%x\n", ~a);//01010000->50

}
